subroutine/SY_3dHeatLoad/Automated/Sim_OutterField/Jet_rhosimple/0/U
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (0 2.71828 3.14159);
//Uinlet          (0 0 -272);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
        //type            slip;
    }

    //symm
    //{
    //    type            symmetry;        
    //}

    

    j20
    {
        type            noSlip;
        //type            slip;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
