subroutine/SY_3dHeatLoad/Automated/Sim_OutterField/Jet_rhosimple/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            calculated;
        value           uniform 0;
    }

    //symm
    //{
    //    type            symmetry;        
    //}

    
    j20
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    //#includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
