subroutine/SY_3dHeatLoad/Automated/Sim_OutterField/Jet_rhosimple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2228;
        startFace       764321;
    }
    j20
    {
        type            wall;
        inGroups        1(wall);
        nFaces          21018;
        startFace       766549;
    }
    outlet
    {
        type            patch;
        nFaces          419;
        startFace       787567;
    }
    inlet
    {
        type            patch;
        nFaces          415;
        startFace       787986;
    }
)

// ************************************************************************* //
